blog/app/controllers/posts_controller.rb

 def create
   @post = Post.new(post_params)
   if @post.save
---
INSERT INTO "posts" ("title", "summary", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Third title"], ["summary", "Third summary"], ["body", "Third body"], ["created_at", "2018-10-24 08:21:37.743179"], ["updated_at", "2018-10-24 08:21:37.743179"]]

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "summary" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", ""], ["summary", ""], ["body", ""], ["updated_at", "2018-10-24 08:32:29.859478"], ["id", 3]]